//游戏说明
import React, { Component, Fragment } from "react";
import { wrappe, GameInstructionsStyle } from "./GameInstructionsStyle";
import I18n, { I18nFunc } from "components/I18n";
import { withRouter } from "react-router-dom";

class GameInstructions extends Component {
  constructor(props) {
    super(props);
  }
  render() {
    const { onShow,onOk } = this.props;
    return (
      <Fragment>
        <GameInstructionsStyle onClick={onShow} >
          <div className={'content'}
          onClick={(e)=>{e.stopPropagation();}}>
            <h1>游戏说明</h1>
            <p>哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希v哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希v哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希v哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希v哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希v哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希v哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希v哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希v哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希v哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希v哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希v哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希v哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希v哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希v哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希v哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希v哈希哈希哈希哈希
            哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希哈希
            </p>
            <div className={'buttonView'}>
            <button onClick={()=>{
              onOk()
            }}>确定</button>
            <button onClick={()=>{
              // onOk()
              //跳转个人资料
              this.props.history.push('/Payments');
            }}>取消</button>
            </div>
            
          </div>
        </GameInstructionsStyle>
      </Fragment>
    );
  }
}

export default withRouter(GameInstructions);
